---
type: DimensionSegment
namespace: Autodesk.Revit.DB
version: 2024
members: 13
tags: [revit-api, class]
---

# DimensionSegment

`Autodesk.Revit.DB.DimensionSegment` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsTextPositionAdjustable | 2015 Subscription Update | `public bool IsTextPositionAdjustable ()` |
| Method | ResetTextPosition | 2015 Subscription Update | `public void ResetTextPosition ()` |
| Property | Above | — | `public string Above { get ; set ; }` |
| Property | Below | — | `public string Below { get ; set ; }` |
| Property | IsLocked | — | `public bool IsLocked { get ; set ; }` |
| Property | LeaderEndPosition | 2015 Subscription Update. | `public XYZ LeaderEndPosition { get ; set ; }` |
| Property | Origin | — | `public XYZ Origin { get ; }` |
| Property | Prefix | — | `public string Prefix { get ; set ; }` |
| Property | Suffix | — | `public string Suffix { get ; set ; }` |
| Property | TextPosition | 2015 Subscription Update | `public XYZ TextPosition { get ; set ; }` |
| Property | Value | — | `public Nullable < double > Value { get ; }` |
| Property | ValueOverride | — | `public string ValueOverride { get ; set ; }` |
| Property | ValueString | — | `public string ValueString { get ; }` |